[
  {
    "filmName": "Star Wars: Episode I - The Phantom Menace",
    "filmYear": "1999",
    "mainCharacter": [
      "Qui-Gon Jinn",
      "Obi-Wan Kenobi",
      "Anakin Skywalker",
      "Padmé Amidala",
      "Jar Jar Binks",
      "Darth Maul"
    ],
    "mainPlanet": "Tatooine",
    "filmSummary": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?",
    "filmRating": "97%"
  },

  {
    "filmName": "Star Wars: Episode II - Attack of the Clones",
    "filmYear": "2002",
    "mainCharacter": [
      "Obi-Wan Kenobi",
      "Anakin Skywalker",
      "Count Dooku",
      "Padmé Amidala",
      "Mace Windu",
      "Yoda",
      "Jango Fett",
      "Supreme Chancellor Palpatine"
    ],
    "mainPlanet": "Coruscant",
    "filmSummary": "Ten years after the 'Phantom Menace' threatened the planet Naboo, Padmé Amidala is now a Senator representing her homeworld. A faction of political separatists, led by Count Dooku, attempts to assassinate her. There are not enough Jedi to defend the Republic against the threat, so Chancellor Palpatine enlists the aid of Jango Fett, who promises that his army of clones will handle the situation. Meanwhile, Obi-Wan Kenobi continues to train the young Jedi Anakin Skywalker, who fears that the Jedi code will forbid his growing romance with Amidala.",
    "filmRating": "98%"
  },

  {
    "title": "Star Wars: Episode III - Revenge of the Sith",
    "filmYear": "2005",
    "mainCharacter": [
      "Obi-Wan Kenobi",
      "Anakin Skywalker",
      "Count Dooku",
      "Padmé Amidala",
      "Mace Windu",
      "Yoda",
      "C-3PO",
      "Supreme Chancellor Palpatine"
    ],
    "mainPlanet": "Mustafar",
    "filmSummary": "Three years after the onset of the Clone Wars; the noble Jedi Knights are spread out across the galaxy leading a massive clone army in the war against the Separatists. After Chancellor Palpatine is kidnapped, Jedi Master Obi-Wan Kenobi and his former Padawan, Anakin Skywalker, are dispatched to eliminate the evil General Grievous. Meanwhile, Anakin's friendship with the Chancellor arouses suspicion in the Jedi Order, and dangerous to the Jedi Knight himself. When the sinister Sith Lord, Darth Sidious, unveils a plot to take over the galaxy, the fate of Anakin, the Jedi order, and the entire galaxy is at stake. Upon his return, Anakin Skywalker's wife Padme Amidala is pregnant, but he is having visions of her dying in childbirth. Anakin Skywalker ultimately turns his back on the Jedi, thus completing his journey to the dark side and his transformation into Darth Vader. Obi-Wan Kenobi must face his former apprentice in a ferocious lightsaber duel on the fiery world of Mustafar.",
    "filmRating": "99%"
  }
]
